blog/drafts/sparse-regression-aesara.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-01 Thu 14:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Sparse regression with Aesara</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Sparse regression with Aesara</h1>
<p>
A few conventions, that are useful to follow:
</p>
<ul class="org-ul">
<li><code>X</code> stands for "array X" or "value X", it represent a float, int, list, numpy array, etc.</li>
<li><code>X_tt</code> stands for "tensor X" and represents a <code>TensorType</code>;</li>
<li><code>X_rv</code> stands for "random variable X" and represent a <code>RandomVariable</code> (check).</li>
</ul>

<p>
We will first import <code>aesara</code> and initialize our RandomStream (TODO: what does a RandomStream do?)
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #d73a49;">import</span> aesara
<span style="color: #d73a49;">import</span> aesara.tensor <span style="color: #d73a49;">as</span> at
<span style="color: #d73a49;">import</span> numpy <span style="color: #d73a49;">as</span> np

<span style="color: #24292e;">srng</span> = at.random.RandomStream(0)
</pre>
</div>

<div id="outline-container-org1981ef5" class="outline-2">
<h2 id="org1981ef5">Horseshoe prior</h2>
<div class="outline-text-2" id="text-org1981ef5">
<p>
Now we can define a simple horsehoe prior:
</p>

\begin{align*}
  \lambda &\sim \operatorname{HalfCauchy}(0, 1)\\
  \tau_{j} &\sim \operatorname{HalfCauchy}(0, 1) \quad \forall i \in [1 \dots k]\\
  \beta_{j}&\sim \operatorname{Normal}(0, \lambda \,\tau_{j}) \quad \forall i \in [1 \dots k]
\end{align*}

<p>
where \(\beta\) is the regression coefficient and \(k\) the number of dimensions of the problem.
</p>

<p>
The horseshoe prior is easily implemented in aesara as:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #24292e;">X</span> = np.random.random((5, 10))
<span style="color: #24292e;">k</span> = np.shape(X)[0]

<span style="color: #24292e;">lambda_rv</span> = srng.halfcauchy(0, 1)
<span style="color: #24292e;">tau_rv</span> = srng.halfcauchy(0, 1, size=k)
<span style="color: #24292e;">beta_rv</span> = srng.normal(0, lambda_rv * tau_rv)
</pre>
</div>

<p>
We can already check that the horsehoe prior is giving us reasonable values by checking the <i>prior predictive</i> distribution. We can easily draw from this distribution with <code>aesara</code>:
</p>

<div class="org-src-container">
<pre class="src src-python">beta_rv.<span style="color: #d73a49;">eval</span>()
</pre>
</div>

<p>
Note that every time <code>.eval()</code> is called aesara returns a different value:
</p>

<div class="org-src-container">
<pre class="src src-python">beta_rv.<span style="color: #d73a49;">eval</span>()
</pre>
</div>
</div>

<div id="outline-container-org6ccebae" class="outline-3">
<h3 id="org6ccebae"><span class="todo TODO">TODO</span> What can we do with this graph?</h3>
</div>
<div id="outline-container-org767e9bb" class="outline-3">
<h3 id="org767e9bb"><span class="todo TODO">TODO</span> Why is it great compared to e.g. PyMC3?</h3>
</div>
<div id="outline-container-orgffdac40" class="outline-3">
<h3 id="orgffdac40">Prior predictive sampling</h3>
<div class="outline-text-3" id="text-orgffdac40">
<p>
The graph indeed carries the random number generator state with it. We can sample more of these quickly using aesara's <code>scan</code> operator. Lets take the following example that works:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #24292e;">num_samples</span> = at.scalar(<span style="color: #032f62;">'num_tensor'</span>, dtype=np.int32)

<span style="color: #24292e;">samples</span>, <span style="color: #24292e;">updates</span> = aesara.scan(
    fn=<span style="color: #d73a49;">lambda</span>: beta_rv,
    n_steps=num_samples
)
<span style="color: #24292e;">sampling_fn</span> = aesara.function((num_samples,), samples, updates=updates)
sampling_fn(10)
</pre>
</div>

<p>
And this one as well:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #24292e;">num_samples</span> = at.scalar(<span style="color: #032f62;">'num_tensor'</span>, dtype=np.int32)

<span style="color: #24292e;">samples</span>, <span style="color: #24292e;">updates</span> = aesara.scan(
    fn=<span style="color: #d73a49;">lambda</span>: at.random.normal(0, tau_rv * lambda_rv),
    n_steps=num_samples
)
<span style="color: #24292e;">sampling_fn</span> = aesara.function((num_samples,), samples, updates=updates)
sampling_fn(10)
</pre>
</div>
</div>
</div>


<div id="outline-container-org3eb7b6e" class="outline-3">
<h3 id="org3eb7b6e">Log-probability density function</h3>
<div class="outline-text-3" id="text-org3eb7b6e">
<p>
Even though we won't need it in this blog post, we expect any PPL to be able to give the the log-probability density function (logpdf) of any model it has defined. For that we will use <code>aeppl</code>.
</p>

<p>
The logpdf will be a function of \(\lambda\), \(\boldysmbol{\tau}\) and \(\beta\). We first need to define the variables that will hold their values:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #d73a49;">from</span> aeppl <span style="color: #d73a49;">import</span> joint_logprob

<span style="color: #24292e;">lambda_tt</span> = at.scalar(<span style="color: #032f62;">"lambda"</span>)
<span style="color: #24292e;">tau_tt</span> = at.vector(<span style="color: #032f62;">"tau"</span>)
<span style="color: #24292e;">beta_tt</span> = at.vector(<span style="color: #032f62;">"beta"</span>)

<span style="color: #6a737d;"># </span><span style="color: #6a737d;">TODO: Explain how the function stuff works</span>
<span style="color: #24292e;">logprob</span> = joint_logprob({tau_rv: tau_tt, lambda_rv: lambda_tt, beta_rv: beta_tt})
<span style="color: #24292e;">logprob_fn</span> = aesara.function((lambda_tt, tau_tt, beta_tt), logprob)
logprob_fn(1., [1, 2, 3, 4, 5], [1, 1, 1, 1, 1])
</pre>
</div>

<p>
Amazing!
</p>
</div>
</div>
</div>

<div id="outline-container-orgc381dec" class="outline-2">
<h2 id="orgc381dec">Negative Binomial regression</h2>
<div class="outline-text-2" id="text-orgc381dec">
<p>
We will now come back to the original topic, performing a /negative binomial sparse regression
</p>

\begin{align*}
  \boldsymbol{Y}_{j} &\sim \operatorname{NegativeBinomial}(h, \boldsymbol{\theta})\\
  \boldsymbol{\theta} &\sim \operatorname{Sigmoid}(- X^{T}\;\beta)
\end{align*}

<p>
\(h\) is xxxx and we will set its value for now:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #24292e;">h</span> = at.as_tensor(100)

<span style="color: #24292e;">theta_tt</span> = at.sigmoid(-at.dot(X.T, beta_rv))
<span style="color: #24292e;">Y_rv</span> = srng.nbinom(h, theta_tt)
Y_rv.<span style="color: #d73a49;">eval</span>()
</pre>
</div>
</div>
</div>

<div id="outline-container-org2ca1716" class="outline-2">
<h2 id="org2ca1716"><span class="todo TODO">TODO</span> New progression</h2>
<div class="outline-text-2" id="text-org2ca1716">
<p>
Show the whole model first, and show that we can actually sample from the prior of \(\beta\) to perform intermediate checks. Something we cannot do otherwise.
</p>
</div>
</div>
<div id="outline-container-org4bfb5bd" class="outline-2">
<h2 id="org4bfb5bd"><span class="todo TODO">TODO</span> Sampling from the posterior</h2>
<div class="outline-text-2" id="text-org4bfb5bd">
<p>
Sampling with <code>aemcmc</code> is great!
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #24292e;">samples</span> = aemcmc.sample(Y_rv, variables, observations, num_samples)
</pre>
</div>

<p>
Explain how it works.
</p>

<p>
Let us now give \(h\) a prior distribution.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #24292e;">samples</span> = aemcmc.sample(Y_rv, y_tt, num_samples)
</pre>
</div>

<p>
Of course this interfaces easily with <code>ArviZ</code>
</p>
</div>

<div id="outline-container-orgc2984e9" class="outline-3">
<h3 id="orgc2984e9"><span class="todo TODO">TODO</span> Show trace and posterior distributions with arviz</h3>
</div>
</div>

<div id="outline-container-org8fbb81b" class="outline-2">
<h2 id="org8fbb81b"><span class="todo TODO">TODO</span> Posterior predictive sampling</h2>
<div class="outline-text-2" id="text-org8fbb81b">
<p>
Posterior predictive sampling is simply that the variables are no longer random variables but have a value. Here it is enough to specify the value of \(\beta\).
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #24292e;">post_pred_fn</span> = aesara.function((beta_rv,), Y_rv)
post_pred_fn([1., 1., 1., 1., 1.])
</pre>
</div>

<p>
To compute this for an array of samples, we can resort to the equivalent of JAX's <code>vmap</code>: numpy universal functions.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #24292e;">vpost_pred_fn</span> = np.vectorize(post_pred_fn, signature=<span style="color: #032f62;">"(n)-&gt;(k)"</span>)
vpost_pred_fn(beta_samples)
</pre>
</div>
</div>
</div>
</div>
</body>
</html>